RB = {
    'А': '⠁',
    'Б': '⠃',
    'В': '⠺',
    'Г': '⠛',
    'Д': '⠙',
    'Е': '⠑',
    'Ё': '⠡',
    'Ж': '⠚',
    'З': '⠵',
    'И': '⠊',
    'Й': '⠯',
    'К': '⠅',
    'Л': '⠇',
    'М': '⠍',
    'Н': '⠝',
    'О': '⠕',
    'П': '⠏',
    'Р': '⠗',
    'С': '⠎',
    'Т': '⠞',
    'У': '⠥',
    'Ф': '⠋',
    'Х': '⠓',
    'Ц': '⠉',
    'Ч': '⠟',
    'Ш': '⠱',
    'Щ': '⠭',
    'Ъ': '⠷',
    'Ы': '⠮',
    'Ь': '⠾',
    'Э': '⠪',
    'Ю': '⠳',
    'Я': '⠫',
    'A': '⠁',
    'B': '⠃',
    'C': '⠉',
    'D': '⠙',
    'E': '⠑',
    'F': '⠋',
    'G': '⠛',
    'H': '⠓',
    'I': '⠊',
    'J': '⠚',
    'K': '⠅',
    'L': '⠇',
    'M': '⠍',
    'N': '⠝',
    'O': '⠕',
    'P': '⠏',
    'Q': '⠟',
    'R': '⠗',
    'S': '⠎',
    'T': '⠞',
    'U': '⠥',
    'V': '⠧',
    'W': '⠺',
    'X': '⠭',
    'Y': '⠽',
    'Z': '⠵',
    '#': '⠼',
    '.': '⠲',
    ',': '⠂',
    '?': '⠢',
    ';': '⠆',
    '-': '⠤',
    '—': '⠤',
    '−': '⠤',
    ' ': ' '
}


async def main(bot, *args, **kwargs):
    """
    rb <text>
    Text to Braille converter
    See also: br
    """
    if not args:
        return
    else:
        text = ' '.join(args)

        result = ''
        for letter in text:
            if letter.upper() in RB:
                result += RB[letter.upper()]
            else:
                result += letter

        return result
